x = 0
# نعرف متغير عالمي 

def change_x():
    x = 1
    # تعريف متغير محلي
    print(f'this is x from local : {x}')
# هذا الأمر سيقوم بطباعة قيمة المتغير المحلي

print(f'this is x from global : {x}') # طباعة المتغير العالمي
change_x() # استدعاء الأمر

#--------------------------
print('-'* 50)

x = 2
# تعريف متغير عالمي

def change_x():
    global x
    # يقوم الأمر بتعريف متغير عالمي على الرغم من كونه داخل أمر مما يجعله محلياً
    x = 3
    # بما أنه تم تعريف هذا المتغير كمتغير عالمي، يمكنه الان تغيير قيمة المتغير العالمي
    print(f'this is x from local : {x}')

    
change_x() # استدعاء الأمر
print(f'this is x from global : {x}') # طباعة قيمة المتغير العالمي قبل التغيير
